使用batch配合链式查询,再次优化
